Terraform plan output for cloudbank:

<details>
<pre>
❯ terraform plan -var-file cloudbank.tfvars                                                                                                      1 ↵
Acquiring state lock. This may take a few moments...
module.service_accounts.google_service_account.service_accounts[0]: Refreshing state... [id=projects/cb-1003-1696/serviceAccounts/cloudbank-2i2c-cd-sa@cb-1003-1696.iam.gserviceaccount.com]
module.gke.random_string.cluster_service_account_suffix: Refreshing state... [id=g6vk]
google_artifact_registry_repository.container_repository: Refreshing state... [id=projects/cb-1003-1696/locations/us-central1/repositories/]
module.gke.google_service_account.cluster_service_account[0]: Refreshing state... [id=projects/cb-1003-1696/serviceAccounts/tf-gke-cloudbank-2i2c--g6vk@cb-1003-1696.iam.gserviceaccount.com]
module.gke.random_shuffle.available_zones: Refreshing state... [id=-]
module.service_accounts.google_project_iam_member.project-roles[1]: Refreshing state... [id=cb-1003-1696/roles/artifactregistry.writer/serviceaccount:cloudbank-2i2c-cd-sa@cb-1003-1696.iam.gserviceaccount.com]
module.service_accounts.google_project_iam_member.project-roles[2]: Refreshing state... [id=cb-1003-1696/roles/compute.instanceAdmin.v1/serviceaccount:cloudbank-2i2c-cd-sa@cb-1003-1696.iam.gserviceaccount.com]
module.service_accounts.google_project_iam_member.project-roles[0]: Refreshing state... [id=cb-1003-1696/roles/container.admin/serviceaccount:cloudbank-2i2c-cd-sa@cb-1003-1696.iam.gserviceaccount.com]
module.gke.google_project_iam_member.cluster_service_account-log_writer[0]: Refreshing state... [id=cb-1003-1696/roles/logging.logWriter/serviceaccount:tf-gke-cloudbank-2i2c--g6vk@cb-1003-1696.iam.gserviceaccount.com]
google_project_iam_member.project: Refreshing state... [id=cb-1003-1696/roles/artifactregistry.reader/serviceaccount:tf-gke-cloudbank-2i2c--g6vk@cb-1003-1696.iam.gserviceaccount.com]
module.service_accounts.google_service_account_key.keys[0]: Refreshing state... [id=projects/cb-1003-1696/serviceAccounts/cloudbank-2i2c-cd-sa@cb-1003-1696.iam.gserviceaccount.com/keys/fce3e582571f7537e9715761a570c6fe29308693]
module.gke.google_container_cluster.primary: Refreshing state... [id=projects/cb-1003-1696/locations/us-central1-b/clusters/cloudbank-2i2c-cluster]
module.gke.google_project_iam_member.cluster_service_account-metric_writer[0]: Refreshing state... [id=cb-1003-1696/roles/monitoring.metricWriter/serviceaccount:tf-gke-cloudbank-2i2c--g6vk@cb-1003-1696.iam.gserviceaccount.com]
module.gke.google_project_iam_member.cluster_service_account-monitoring_viewer[0]: Refreshing state... [id=cb-1003-1696/roles/monitoring.viewer/serviceaccount:tf-gke-cloudbank-2i2c--g6vk@cb-1003-1696.iam.gserviceaccount.com]
module.gke.google_project_iam_member.cluster_service_account-resourceMetadata-writer[0]: Refreshing state... [id=cb-1003-1696/roles/stackdriver.resourceMetadata.writer/serviceaccount:tf-gke-cloudbank-2i2c--g6vk@cb-1003-1696.iam.gserviceaccount.com]
module.gke.google_container_node_pool.pools["user-pool-2020-09-29"]: Refreshing state... [id=projects/cb-1003-1696/locations/us-central1-b/clusters/cloudbank-2i2c-cluster/nodePools/user-pool-2020-09-29]
module.gke.google_container_node_pool.pools["core-pool"]: Refreshing state... [id=projects/cb-1003-1696/locations/us-central1-b/clusters/cloudbank-2i2c-cluster/nodePools/core-pool]
module.gke.google_container_node_pool.pools["dask-worker-pool-2020-12-11"]: Refreshing state... [id=projects/cb-1003-1696/locations/us-central1-b/clusters/cloudbank-2i2c-cluster/nodePools/dask-worker-pool-2020-12-11]
module.gke.module.gcloud_delete_default_kube_dns_configmap.module.gcloud_kubectl.null_resource.module_depends_on[0]: Refreshing state... [id=4007092501278997687]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.gke.google_container_cluster.primary will be updated in-place
  ~ resource "google_container_cluster" "primary" {
        id                          = "projects/cb-1003-1696/locations/us-central1-b/clusters/cloudbank-2i2c-cluster"
      ~ min_master_version          = "1.18.15-gke.1100" -> "1.19.9-gke.1900"
        name                        = "cloudbank-2i2c-cluster"
      ~ remove_default_node_pool    = false -> true
        # (25 unchanged attributes hidden)













        # (16 unchanged blocks hidden)
    }

  # module.gke.google_container_node_pool.pools["core-pool"] must be replaced
-/+ resource "google_container_node_pool" "pools" {
      ~ id                  = "projects/cb-1003-1696/locations/us-central1-b/clusters/cloudbank-2i2c-cluster/nodePools/core-pool" -> (known after apply)
      ~ instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/cb-1003-1696/zones/us-central1-b/instanceGroupManagers/gke-cloudbank-2i2c-cluster-core-pool-2008707b-grp",
        ] -> (known after apply)
      ~ max_pods_per_node   = 110 -> (known after apply)
        name                = "core-pool"
      + name_prefix         = (known after apply)
      ~ node_count          = 1 -> (known after apply)
      ~ node_locations      = [
          - "us-central1-b",
        ] -> (known after apply)
      + operation           = (known after apply)
        # (5 unchanged attributes hidden)

      ~ autoscaling {
          ~ max_node_count = 10 -> 5
            # (1 unchanged attribute hidden)
        }


      ~ node_config {
          ~ disk_size_gb      = 100 -> 50 # forces replacement
          ~ image_type        = "UBUNTU" -> "COS"
          ~ labels            = { # forces replacement
              + "hub.jupyter.org/node-purpose" = "core"
              + "k8s.dask.org/node-purpose"    = "core"
                # (4 unchanged elements hidden)
            }
          ~ machine_type      = "n1-highmem-2" -> "e2-highcpu-4" # forces replacement
            tags              = [
                "gke-cloudbank-2i2c-cluster",
                "gke-cloudbank-2i2c-cluster-core-pool",
            ]
          ~ taint             = [] -> (known after apply)
            # (7 unchanged attributes hidden)


            # (2 unchanged blocks hidden)
        }


      ~ upgrade_settings {
          ~ max_surge       = 1 -> (known after apply)
          ~ max_unavailable = 0 -> (known after apply)
        }
        # (2 unchanged blocks hidden)
    }

  # module.gke.google_container_node_pool.pools["dask-worker-pool"] will be created
  + resource "google_container_node_pool" "pools" {
      + cluster             = "cloudbank-2i2c-cluster"
      + id                  = (known after apply)
      + initial_node_count  = 0
      + instance_group_urls = (known after apply)
      + location            = "us-central1-b"
      + max_pods_per_node   = (known after apply)
      + name                = "dask-worker-pool"
      + name_prefix         = (known after apply)
      + node_count          = (known after apply)
      + node_locations      = (known after apply)
      + operation           = (known after apply)
      + project             = "cb-1003-1696"
      + version             = "1.17.12-gke.2502"

      + autoscaling {
          + max_node_count = 10
          + min_node_count = 0
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = false
        }

      + node_config {
          + disk_size_gb      = 100
          + disk_type         = "pd-ssd"
          + guest_accelerator = []
          + image_type        = "COS"
          + labels            = {
              + "cluster_name"              = "cloudbank-2i2c-cluster"
              + "hub.jupyter.org/pool-name" = "dask-worker-pool"
              + "k8s.dask.org/node-purpose" = "worker"
              + "node_pool"                 = "dask-worker-pool"
            }
          + local_ssd_count   = 0
          + machine_type      = "e2-highmem-2"
          + metadata          = {
              + "cluster_name"             = "cloudbank-2i2c-cluster"
              + "disable-legacy-endpoints" = "true"
              + "node_pool"                = "dask-worker-pool"
            }
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = true
          + service_account   = "tf-gke-cloudbank-2i2c--g6vk@cb-1003-1696.iam.gserviceaccount.com"
          + tags              = [
              + "gke-cloudbank-2i2c-cluster",
              + "gke-cloudbank-2i2c-cluster-dask-worker-pool",
            ]
          + taint             = [
              + {
                  + effect = "NO_SCHEDULE"
                  + key    = "k8s.dask.org_dedicated"
                  + value  = "worker"
                },
            ]

          + shielded_instance_config {
              + enable_integrity_monitoring = true
              + enable_secure_boot          = false
            }

          + workload_metadata_config {
              + node_metadata = "GKE_METADATA_SERVER"
            }
        }

      + timeouts {
          + create = "45m"
          + delete = "45m"
          + update = "45m"
        }

      + upgrade_settings {
          + max_surge       = (known after apply)
          + max_unavailable = (known after apply)
        }
    }

  # module.gke.google_container_node_pool.pools["dask-worker-pool-2020-12-11"] will be destroyed
  - resource "google_container_node_pool" "pools" {
      - cluster             = "cloudbank-2i2c-cluster" -> null
      - id                  = "projects/cb-1003-1696/locations/us-central1-b/clusters/cloudbank-2i2c-cluster/nodePools/dask-worker-pool-2020-12-11" -> null
      - initial_node_count  = 0 -> null
      - instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/cb-1003-1696/zones/us-central1-b/instanceGroupManagers/gke-cloudbank-2i2c-c-dask-worker-pool-729d24bb-grp",
        ] -> null
      - location            = "us-central1-b" -> null
      - max_pods_per_node   = 110 -> null
      - name                = "dask-worker-pool-2020-12-11" -> null
      - node_count          = 0 -> null
      - node_locations      = [
          - "us-central1-b",
        ] -> null
      - project             = "cb-1003-1696" -> null
      - version             = "1.17.12-gke.2502" -> null

      - autoscaling {
          - max_node_count = 10 -> null
          - min_node_count = 0 -> null
        }

      - management {
          - auto_repair  = true -> null
          - auto_upgrade = false -> null
        }

      - node_config {
          - disk_size_gb      = 100 -> null
          - disk_type         = "pd-ssd" -> null
          - guest_accelerator = [] -> null
          - image_type        = "UBUNTU" -> null
          - labels            = {
              - "cluster_name"              = "cloudbank-2i2c-cluster"
              - "hub.jupyter.org/pool-name" = "dask-worker-pool"
              - "node_pool"                 = "dask-worker-pool-2020-12-11"
            } -> null
          - local_ssd_count   = 0 -> null
          - machine_type      = "e2-standard-4" -> null
          - metadata          = {
              - "cluster_name"             = "cloudbank-2i2c-cluster"
              - "disable-legacy-endpoints" = "true"
              - "node_pool"                = "dask-worker-pool-2020-12-11"
            } -> null
          - oauth_scopes      = [
              - "https://www.googleapis.com/auth/cloud-platform",
            ] -> null
          - preemptible       = true -> null
          - service_account   = "tf-gke-cloudbank-2i2c--g6vk@cb-1003-1696.iam.gserviceaccount.com" -> null
          - tags              = [
              - "gke-cloudbank-2i2c-cluster",
              - "gke-cloudbank-2i2c-cluster-dask-worker-pool-2020-12-11",
            ] -> null
          - taint             = [
              - {
                  - effect = "NO_SCHEDULE"
                  - key    = "k8s.dask.org_dedicated"
                  - value  = "worker"
                },
            ] -> null

          - shielded_instance_config {
              - enable_integrity_monitoring = true -> null
              - enable_secure_boot          = false -> null
            }

          - workload_metadata_config {
              - node_metadata = "GKE_METADATA_SERVER" -> null
            }
        }

      - timeouts {
          - create = "45m" -> null
          - delete = "45m" -> null
          - update = "45m" -> null
        }

      - upgrade_settings {
          - max_surge       = 1 -> null
          - max_unavailable = 0 -> null
        }
    }

  # module.gke.google_container_node_pool.pools["user-pool"] will be created
  + resource "google_container_node_pool" "pools" {
      + cluster             = "cloudbank-2i2c-cluster"
      + id                  = (known after apply)
      + initial_node_count  = 0
      + instance_group_urls = (known after apply)
      + location            = "us-central1-b"
      + max_pods_per_node   = (known after apply)
      + name                = "user-pool"
      + name_prefix         = (known after apply)
      + node_count          = (known after apply)
      + node_locations      = (known after apply)
      + operation           = (known after apply)
      + project             = "cb-1003-1696"
      + version             = "1.17.12-gke.2502"

      + autoscaling {
          + max_node_count = 10
          + min_node_count = 0
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = false
        }

      + node_config {
          + disk_size_gb      = 100
          + disk_type         = "pd-ssd"
          + guest_accelerator = []
          + image_type        = "COS"
          + labels            = {
              + "cluster_name"                 = "cloudbank-2i2c-cluster"
              + "hub.jupyter.org/node-purpose" = "user"
              + "hub.jupyter.org/pool-name"    = "user-pool"
              + "k8s.dask.org/node-purpose"    = "scheduler"
              + "node_pool"                    = "user-pool"
            }
          + local_ssd_count   = 0
          + machine_type      = "n1-standard-4"
          + metadata          = {
              + "cluster_name"             = "cloudbank-2i2c-cluster"
              + "disable-legacy-endpoints" = "true"
              + "node_pool"                = "user-pool"
            }
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = false
          + service_account   = "tf-gke-cloudbank-2i2c--g6vk@cb-1003-1696.iam.gserviceaccount.com"
          + tags              = [
              + "gke-cloudbank-2i2c-cluster",
              + "gke-cloudbank-2i2c-cluster-user-pool",
            ]
          + taint             = [
              + {
                  + effect = "NO_SCHEDULE"
                  + key    = "hub.jupyter.org_dedicated"
                  + value  = "user"
                },
            ]

          + shielded_instance_config {
              + enable_integrity_monitoring = true
              + enable_secure_boot          = false
            }

          + workload_metadata_config {
              + node_metadata = "GKE_METADATA_SERVER"
            }
        }

      + timeouts {
          + create = "45m"
          + delete = "45m"
          + update = "45m"
        }

      + upgrade_settings {
          + max_surge       = (known after apply)
          + max_unavailable = (known after apply)
        }
    }

  # module.gke.google_container_node_pool.pools["user-pool-2020-09-29"] will be destroyed
  - resource "google_container_node_pool" "pools" {
      - cluster             = "cloudbank-2i2c-cluster" -> null
      - id                  = "projects/cb-1003-1696/locations/us-central1-b/clusters/cloudbank-2i2c-cluster/nodePools/user-pool-2020-09-29" -> null
      - initial_node_count  = 0 -> null
      - instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/cb-1003-1696/zones/us-central1-b/instanceGroupManagers/gke-cloudbank-2i2c-c-user-pool-2020-0-22cd12eb-grp",
        ] -> null
      - location            = "us-central1-b" -> null
      - max_pods_per_node   = 110 -> null
      - name                = "user-pool-2020-09-29" -> null
      - node_count          = 1 -> null
      - node_locations      = [
          - "us-central1-b",
        ] -> null
      - project             = "cb-1003-1696" -> null
      - version             = "1.17.12-gke.2502" -> null

      - autoscaling {
          - max_node_count = 10 -> null
          - min_node_count = 0 -> null
        }

      - management {
          - auto_repair  = true -> null
          - auto_upgrade = false -> null
        }

      - node_config {
          - disk_size_gb      = 100 -> null
          - disk_type         = "pd-ssd" -> null
          - guest_accelerator = [] -> null
          - image_type        = "UBUNTU" -> null
          - labels            = {
              - "cluster_name"              = "cloudbank-2i2c-cluster"
              - "hub.jupyter.org/pool-name" = "user-pool"
              - "node_pool"                 = "user-pool-2020-09-29"
            } -> null
          - local_ssd_count   = 0 -> null
          - machine_type      = "n1-highmem-4" -> null
          - metadata          = {
              - "cluster_name"             = "cloudbank-2i2c-cluster"
              - "disable-legacy-endpoints" = "true"
              - "node_pool"                = "user-pool-2020-09-29"
            } -> null
          - oauth_scopes      = [
              - "https://www.googleapis.com/auth/cloud-platform",
            ] -> null
          - preemptible       = false -> null
          - service_account   = "tf-gke-cloudbank-2i2c--g6vk@cb-1003-1696.iam.gserviceaccount.com" -> null
          - tags              = [
              - "gke-cloudbank-2i2c-cluster",
              - "gke-cloudbank-2i2c-cluster-user-pool-2020-09-29",
            ] -> null
          - taint             = [
              - {
                  - effect = "NO_SCHEDULE"
                  - key    = "hub.jupyter.org_dedicated"
                  - value  = "user"
                },
            ] -> null

          - shielded_instance_config {
              - enable_integrity_monitoring = true -> null
              - enable_secure_boot          = false -> null
            }

          - workload_metadata_config {
              - node_metadata = "GKE_METADATA_SERVER" -> null
            }
        }

      - timeouts {
          - create = "45m" -> null
          - delete = "45m" -> null
          - update = "45m" -> null
        }

      - upgrade_settings {
          - max_surge       = 1 -> null
          - max_unavailable = 0 -> null
        }
    }

Plan: 3 to add, 1 to change, 3 to destroy.

Changes to Outputs:
    # (1 unchanged attribute hidden)

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

Releasing state lock. This may take a few moments...
</pre>
</details>

For pilot-hubs

<details>
<pre>
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.gke.google_container_cluster.primary will be updated in-place
  ~ resource "google_container_cluster" "primary" {
        id                          = "projects/two-eye-two-see/locations/us-central1-b/clusters/low-touch-hubs-cluster"
      ~ min_master_version          = "1.18.15-gke.1500" -> "1.19.9-gke.1900"
        name                        = "low-touch-hubs-cluster"
        # (26 unchanged attributes hidden)














        # (16 unchanged blocks hidden)
    }

  # module.gke.google_container_node_pool.pools["core-pool"] must be replaced
-/+ resource "google_container_node_pool" "pools" {
      ~ id                  = "projects/two-eye-two-see/locations/us-central1-b/clusters/low-touch-hubs-cluster/nodePools/core-pool" -> (known after apply)
      ~ instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/two-eye-two-see/zones/us-central1-b/instanceGroupManagers/gke-low-touch-hubs-cluster-core-pool-097eafe9-grp",
        ] -> (known after apply)
      ~ max_pods_per_node   = 110 -> (known after apply)
        name                = "core-pool"
      + name_prefix         = (known after apply)
      ~ node_count          = 1 -> (known after apply)
      ~ node_locations      = [
          - "us-central1-b",
        ] -> (known after apply)
      + operation           = (known after apply)
        # (5 unchanged attributes hidden)

      ~ autoscaling {
          ~ max_node_count = 10 -> 5
            # (1 unchanged attribute hidden)
        }


      ~ node_config {
          ~ disk_size_gb      = 100 -> 50 # forces replacement
          ~ labels            = { # forces replacement
              + "hub.jupyter.org/node-purpose" = "core"
              + "k8s.dask.org/node-purpose"    = "core"
                # (4 unchanged elements hidden)
            }
          ~ machine_type      = "n1-highmem-4" -> "e2-highcpu-4" # forces replacement
            tags              = [
                "gke-low-touch-hubs-cluster",
                "gke-low-touch-hubs-cluster-core-pool",
            ]
          ~ taint             = [] -> (known after apply)
            # (8 unchanged attributes hidden)


            # (2 unchanged blocks hidden)
        }


      ~ upgrade_settings {
          ~ max_surge       = 1 -> (known after apply)
          ~ max_unavailable = 0 -> (known after apply)
        }
        # (2 unchanged blocks hidden)
    }

  # module.gke.google_container_node_pool.pools["dask-worker-pool"] must be replaced
-/+ resource "google_container_node_pool" "pools" {
      ~ id                  = "projects/two-eye-two-see/locations/us-central1-b/clusters/low-touch-hubs-cluster/nodePools/dask-worker-pool" -> (known after apply)
      ~ instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/two-eye-two-see/zones/us-central1-b/instanceGroupManagers/gke-low-touch-hubs-c-dask-worker-pool-366d69db-grp",
        ] -> (known after apply)
      ~ max_pods_per_node   = 110 -> (known after apply)
        name                = "dask-worker-pool"
      + name_prefix         = (known after apply)
      ~ node_count          = 0 -> (known after apply)
      ~ node_locations      = [
          - "us-central1-b",
        ] -> (known after apply)
      + operation           = (known after apply)
        # (5 unchanged attributes hidden)



      ~ node_config {
          ~ labels            = { # forces replacement
              + "k8s.dask.org/node-purpose" = "worker"
                # (3 unchanged elements hidden)
            }
            tags              = [
                "gke-low-touch-hubs-cluster",
                "gke-low-touch-hubs-cluster-dask-worker-pool",
            ]
            # (11 unchanged attributes hidden)


            # (2 unchanged blocks hidden)
        }


      ~ upgrade_settings {
          ~ max_surge       = 1 -> (known after apply)
          ~ max_unavailable = 0 -> (known after apply)
        }
        # (3 unchanged blocks hidden)
    }

  # module.gke.google_container_node_pool.pools["user-pool"] must be replaced
-/+ resource "google_container_node_pool" "pools" {
      ~ id                  = "projects/two-eye-two-see/locations/us-central1-b/clusters/low-touch-hubs-cluster/nodePools/user-pool" -> (known after apply)
      ~ instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/two-eye-two-see/zones/us-central1-b/instanceGroupManagers/gke-low-touch-hubs-cluster-user-pool-f2555475-grp",
        ] -> (known after apply)
      ~ max_pods_per_node   = 110 -> (known after apply)
        name                = "user-pool"
      + name_prefix         = (known after apply)
      ~ node_count          = 1 -> (known after apply)
      ~ node_locations      = [
          - "us-central1-b",
        ] -> (known after apply)
      + operation           = (known after apply)
        # (5 unchanged attributes hidden)



      ~ node_config {
          ~ labels            = { # forces replacement
              + "hub.jupyter.org/node-purpose" = "user"
              + "k8s.dask.org/node-purpose"    = "scheduler"
                # (3 unchanged elements hidden)
            }
          ~ machine_type      = "n1-highmem-2" -> "n1-standard-4" # forces replacement
            tags              = [
                "gke-low-touch-hubs-cluster",
                "gke-low-touch-hubs-cluster-user-pool",
            ]
            # (10 unchanged attributes hidden)


            # (2 unchanged blocks hidden)
        }


      ~ upgrade_settings {
          ~ max_surge       = 1 -> (known after apply)
          ~ max_unavailable = 0 -> (known after apply)
        }
        # (3 unchanged blocks hidden)
    }

Plan: 3 to add, 1 to change, 3 to destroy.

Changes to Outputs:
    # (1 unchanged attribute hidden)

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

Releasing state lock. This may take a few moments...
</pre>
</details>

I need to figure out permissions for the palehack hub.

@damianavila given that these are destructive changes, I want to add on a k8s cluster upgrade too along with this. Objections?